In [1]:
# databse
# database vitra table hunxa vanesi one data base can have multiple tables

# Connect and Create a New Database

In [2]:
import sqlite3

In [3]:
con = sqlite3.connect('student.db') # create and connect to the databse

In [4]:
con

In [5]:
type(con)

sqlite3.Connection

After connection we need to execute sql query to read, write on database table.  Therefore, we need cursor to do so. cursor executes sql query

In [6]:
cur = con.cursor() # cursor executes SQL query

# Create table on databse

```sql
create table table_name (
roll_no int, 
name varchar(20),
```

In [7]:
create_table_query = """
create table student (roll_no int, name varchar(40))
"""

In [8]:
cur.execute(create_table_query)

# Insert operation on SQL

```sql
INSERT INTO table_name (column1, column2, column3, ...)
VALUES (value1, value2, value3, ...),
(value11, value12, value13, ...);
```

In [9]:
insert_data_query = """
Insert into student 
(roll_no, name)
values 
(1, "Sandeep"),
(2, "Shaurya"),
(3, "Kshitiz")
"""

In [10]:
cur.execute(insert_data_query)

# Read data from a table

```sql
select * from table_name
```

In [11]:
read_query = """
select * from student
"""

In [12]:
cur.execute(read_query)

In [13]:
cur.execute(read_query).fetchall()

[(1, 'Sandeep'), (2, 'Shaurya'), (3, 'Kshitiz')]

In [14]:
cur.execute("select name from student").fetchall() # read name column only

[('Sandeep',), ('Shaurya',), ('Kshitiz',)]

In [15]:
# find the roll no of student named Kshitiz
# use where statement for conditional operation
cur.execute("select roll_no from student where name = 'Kshitiz'").fetchall()

[(3,)]

# update in sql

```sql
update table_name
set column1 = value1 
WHERE condition;
```

In [16]:
# i want to update roll_no 3 name to Kshitiz Regmi

In [17]:
updatename = """
update student 
set name = 'Kshitiz Regmi'
where 
roll_no = 3
"""

In [18]:
cur.execute(updatename)

In [19]:
cur.execute("Select * from student").fetchall()

[(1, 'Sandeep'), (2, 'Shaurya'), (3, 'Kshitiz Regmi')]

# Delete operation in SQL

```sql
delete from table
where condition;
```

In [20]:
cur.execute("delete from student where roll_no = 3")

In [21]:
cur.execute("select * from student").fetchall()

[(1, 'Sandeep'), (2, 'Shaurya')]

In [22]:
def create_insert_query(table_name, columns):
    
    insert = f"""
    Insert into {table_name} 
    {columns}
    values 
    (?, ?)
    """
    return insert

In [24]:
query = create_insert_query(table_name = "student", 
                    columns = ('roll_no', 'name'),
                     )

In [25]:
print(query)

    Insert into student
    ('roll_no', 'name')
    values
    (?, ?)

In [26]:
datapoints = ((4, "shyam"), (5, 'ram'))
cur.executemany(query, datapoints)